# shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=0b5ce6d7-9925-4b8e-a679-8a3430763acd]
module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-f7d215e1-25bc-4723-b832-adad4cba6398]
module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=upstash_kafka_cluster_id]
module.common_resources.module.simple_email_service.aws_ses_domain_identity.default: Refreshing state... [id=staging-mail.connectilly.com]
module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default: Refreshing state... [id=staging-mail.connectilly.com]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_b5lBDIQaz]
module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default: Refreshing state... [id=stagingconnectilly]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_id will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_id"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_secret will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_secret"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "aws_user_pool_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*